Public Member Functions | Public Attributes | List of all members
API_ProjectInfo Struct Reference
Project Operations
Contains information about the current project. More...
#include <APIdefs_Environment.h>
 Public Member Functions
API_ProjectInfo ()
~API_ProjectInfo ()
 Public Attributes
bool  | untitled
Indicates that the project file has not been saved yet.
bool  | teamwork
Signed into a team project or not.
short  | userId
team project member ID; if signed into a team project.
Int32  | workGroupMode
team project member rights; if signed into a team project
IO::Location *  | location
Location of the non-teamwork project file.
IO::Location *  | location_team
the shared project file; if signed into a team project.
UInt64  | modiStamp
Modification stamp of project.
GS::UniString *  | projectPath
optional; location of the project as string.
GS::UniString *  | projectName
optional; name of the project as Unicode string.
Detailed Description
Contains information about the current project.
See also
ACAPI_Environment_GetProject
Remarks
This structure is used to get information about the current project.
Constructor & Destructor Documentation
◆ API_ProjectInfo()
 API_ProjectInfo::API_ProjectInfo  |  ( |   | )
inline
◆ ~API_ProjectInfo()
 API_ProjectInfo::~API_ProjectInfo  |  ( |   | )
inline
Member Data Documentation
◆ location
 API_ProjectInfo::location
Location of the non-teamwork project file.
◆ location_team
 API_ProjectInfo::location_team
the shared project file; if signed into a team project.
Destroys the project info (also cleans up)
◆ modiStamp
 API_ProjectInfo::modiStamp
Modification stamp of project.
◆ projectName
 API_ProjectInfo::projectName
optional; name of the project as Unicode string.
◆ projectPath
 API_ProjectInfo::projectPath
optional; location of the project as string.
◆ teamwork
 API_ProjectInfo::teamwork
Signed into a team project or not.
◆ untitled
 API_ProjectInfo::untitled
Indicates that the project file has not been saved yet.
◆ userId
 API_ProjectInfo::userId
team project member ID; if signed into a team project.
◆ workGroupMode
 API_ProjectInfo::workGroupMode
team project member rights; if signed into a team project